{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 126,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [null, 1890],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 170,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 170,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 35,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 34,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense5",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.10.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.10.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": ["./handModel.weights.bin"],
      "weights": [
        {
          "name": "dense_Dense1/kernel",
          "shape": [1890, 126],
          "dtype": "float32"
        },
        { "name": "dense_Dense1/bias", "shape": [126], "dtype": "float32" },
        {
          "name": "dense_Dense2/kernel",
          "shape": [126, 170],
          "dtype": "float32"
        },
        { "name": "dense_Dense2/bias", "shape": [170], "dtype": "float32" },
        {
          "name": "dense_Dense3/kernel",
          "shape": [170, 170],
          "dtype": "float32"
        },
        { "name": "dense_Dense3/bias", "shape": [170], "dtype": "float32" },
        {
          "name": "dense_Dense4/kernel",
          "shape": [170, 35],
          "dtype": "float32"
        },
        { "name": "dense_Dense4/bias", "shape": [35], "dtype": "float32" },
        {
          "name": "dense_Dense5/kernel",
          "shape": [35, 34],
          "dtype": "float32"
        },
        { "name": "dense_Dense5/bias", "shape": [34], "dtype": "float32" }
      ]
    }
  ]
}
